using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows.Forms;

namespace socTests
{
    public partial class ShowDual : Form
    {
        private Bitmap MyImage;
        public ShowDual()
        {
            InitializeComponent();
        }

        private void resCloseButton_Click(object sender, EventArgs e)
        {
            Form1 form1 = new Form1();
            this.Close();
        }

        private void ShowDual_Load(object sender, EventArgs e)
        {
            if (Test1.resnewform == "ILE")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\SEI.jpg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "СЕІ- «Дюма», БС + ЧЕ\nЕтика емоцій для сенсорики відчуттів\n.Найширший і чистий канал сприйняття у Дюми - сенсорика відчуттів, перше, що спадає на думку, що має значення -фізичні відчуття.Така людина вміє прагнути до затишку і комфорту, неквапливості, збереженню здоров'я і краси, знає в цьому толк.Частіше не любить біль, напруга. Основний інструмент для здійснення всього цього -емоції.Можуть кокетувати заради того, щоб отримати допомогу з метою забезпечення комфорту.Уміють створити радісну атмосферу, щоб в ній можна було розслабитися.Можуть експериментувати з інтенсивністю і різноманіттям емоцій, щоб задати потрібну обстановку в своєму просторі.";
            }
            if (Test1.resnewform == "SEI")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\ILE.jpeg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ІЛЕ- «Дон Кіхот», ЧІ + БЛ\nСтруктурна логіка для інтуїції можливостей\nТакий базовий блок дозволяє добре пояснювати і використовувати логіку для пошуку нових можливостей.Шукати пояснення, щоб зрозуміти і показати іншим суть предмета. Така людина може вдало і легко генерувати ідеї. А для їх просування використовується структурна логіка - структурування, пояснення їх іншим.ЧИ + БЛ уважні, своїм логічним мисленням можуть постійно шукати нове.Уміють вийти за рамки обмежень(як в науці, так в соціумі), норм, проявити свою унікальність.";
            }
            if (Test1.resnewform == "ESE")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\LII.jpg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ЛІІ - «Робесп'єр», БЛ + ЧІ\nІнтуїція можливостей для структурної логіки\nУміють використовувати можливості, нові і різні, для підтримки певної логічної концепції.Уміють глибоко зрозуміти суть предмета, розібратися в ньому, тоді предмет вписується в систему, через призму якої базовий блок БЛ +ЧІ сприймає світ. Уміють будь-яка подія, будь - яке відчуття, почуття пояснити, вписати в певну логічну концепцію.";
            }
            if (Test1.resnewform == "LII")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\ESE.png", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ЕСЕ - «Гюго», ЧЕ + БС\nСенсорика відчуттів для етики емоцій\nНайширший і чистий канал сприймає інформацію про емоційне тло, веселощі, радості.Такі люди можуть добре вміти влаштовувати свята, збіговиська, можливо з різноманітністю смачної їжі.Уміють добре одягатися, добре виглядати, вміють привертати увагу. Для них може бути важливо викликати до себе повагу і добре ставлення. А який інструмент для цього? Сенсорика відчуттів. «Створю комфорт і всім буде весело. Буду красиво виглядати і все мене будуть любити. »Уміють експериментувати в області сенсорики відчуттів, в залежності від того, який створюється емоційний фон.";
            }
            if (Test1.resnewform == "IEI")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\SLE.jpg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "СЛЕ- «Жуков», ВС + БЛ\nСтруктурна логіка для вольової сенсорики\nТакий блок дозволяє структурувати простір, створювати ієрархії, командувати і змушувати інших функціонувати в своїх цілях.Вміє ставити стратегічні завдання. Визначати оптимальну йому розстановку сил, маючи в своєму розпорядженні інших учасників кожного в своїй комірці. Людина вміє пояснити будь-яку ситуацію, що виникла. Переупорядкувати її потрібним чином. Завдання блоку -затвердити свою впевненість, свій статус, становище.";
            }
            if (Test1.resnewform == "SLE")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\IEI.jpg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ІЕІ- «Єсенін», БІ ЧЕ\nЕтика емоцій для інтуїції часу\nВміє відчувати будь дрібне зміна.Особливо - зміна в настроях себе і людей.Вміє звертати увагу на події і відчувати, як вони будуть розвиватися далі.Розбирається в тенденціях розвитку подій, вміє зберігати пам'ять про те, що дорого (особливо, що було дорого). Вміє виявляти примхливість в своїх цілях. За допомогою емоцій, формуючи потрібне ставлення до себе, може тонко маніпулювати людьми і ситуацією.Створюють фон, при якому події сприймаються належним чином.Важливі зміни вміють підсвічуватися якимсь відтінком емоцій.Емоційним фоном може створюватися найбільш вдала і гармонійна обстановка.Може бути цікаво експериментувати з інтенсивністю емоцій.";
            }
            if (Test1.resnewform == "EIE")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\LSI.jpg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ЛСІ- «Максим Горький», БЛ + ВС\nВольова сенсорика для структурної логіки\nТакий базовий блок дозволяє його володареві добре розбиратися в тому, як зберігати порядок, як закріплювати закони і правила і контролювати їх виконання. Такий базовий блок дає сприйняття всього навколо, немов якоїсь структури, статичної картинки, де всі об'єкти пов'язані ієрархічно. І не дозволяє цього сприйняття зайвий раз змінюватися. Вміє відслідковувати виконання планів точно, як потрібно. Вміє впевнено наполягати на своєму там, де це стосується важливих переконань і правил.";
            }
            if (Test1.resnewform == "LSI")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\EIE.jpg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ЕІЕ- «Гамлет», ЧЕ + БІ\nІнтуїція часу для етики емоцій\nУміють відчувати емоційний стан об'єкта і те, як і коли впливати емоційно. В який час відіграти відповідну роль. Вміє відігравати одну і ту ж роль з різним емоційним забарвленням.Базовий блок дозволяє підлаштовувати ситуацію і підлаштовуватися під неї так, щоб проявити саме ті емоції, які потрібні для досягнення бажаної мети, і вибирати для цього ідеальний момент. Також викликати повагу і ставлення до себе.Базовий блок хоче перебувати в потрібному емоційному стані у відповідний час.Вміє вибрати ідеальний момент для емоційного впливу.";
            }
            if (Test1.resnewform == "LIE")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\ESI.jpeg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ЕСІ- «Драйзер», БЕ + ВС\nВольова сенсорика для етики відносин\nБазовий блок працює на збереження відносин. Зокрема, свого ставлення до об'єктів. Якщо у людини є певне ставлення до людини чи до ситуації або до колективу, то зусилля вольової сенсорики вміють бути спрямованими на те, щоб це відношення не мінялося. Уміють впливати на людей, відстоювати свою позицію, своєю впевненістю закріплюючи свої моральні принципи. Можуть визначати і зберігати дистанцію між собою і людьми таку, щоб до них було певне ставлення.";
            }
            if (Test1.resnewform == "ESI")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\LIE.jpeg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ЛІЕ- «Джек Лондон», ДЛ + БІ\nІнтуїція часу для ділової логіки\nЧас для справ.Саме ясне в сприйнятті такого блоку -справи, дії, потоки активності. Ефективність дій. Що б не відбувалося, вміють розібратися в ситуації, в тому, як отримати користь і куди рухатися далі, як вирішувати проблеми. Інструмент - інтуїтивне мислення, планування, вміння бачити розвиток подій в майбутньому і відповідно до цього розподіляти справи. Людина може добре відчувати час, наприклад, скільки часу піде на якісь справи, планувати. Чим закінчиться той чи інший процес, чи має він перспективи, які перспективи потрібні.Можуть експериментувати з організацією і плануванням робочого процесу для отримання оптимального результату.";
            }
            if (Test1.resnewform == "SEE")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\pNGTP3rrZVA.jpeg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ІЛІ- «Бальзак», БІ + ДЛ \nДілова логіка для інтуїції часу\nТут основна функція має на увазі спостереження. Уміють дивитися за ходом подій, відстежувати зміни. І в потрібний момент лише включати свій інструмент -ділову логіку, швидко і ефективно щось зробити, отримати необхідну користь.Вони терпляче вміють спостерігати, чекаючи того єдиного моменту, участь в якому принесе оптимальну користь. Результат якої піде на забезпечення подальшого очікування.";
            }
            if (Test1.resnewform == "ILI")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\SEE.jpg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "СЕЕ- «Наполеон», ВС + БЕ\nЕтика відносин для вольової сенсорики\nБазовий блок працює так, що ставлення людини до інших або до об'єктів вміє змінюватися і виявлятися в тому вигляді, а який для ситуації оптимальний. Базовий блок спрямований на отримання влади над ситуацією, збільшення впевненості в ній. Людина вміє бути впевненим, відчувати свою значимість, свій (і не тільки) статус. За допомогою етики і своїм ставленням до навколишнього світу вміє формувати ситуацію так, як потрібно.";
            }
            if (Test1.resnewform == "EII")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\LSE.jpg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ЛСЕ- «Штірліц», ДЛ + БС\nСенсорика відчуттів для ділової логіки\nБазовий блок дає здатність детально і якісно виконувати свою роботу, до будь-яких процесів підходити уважно, вивчати ретельно з метою забезпечення ефективної діяльності.Вміє займатися детальною розробкою планів.Вміє створити комфортні умови для роботи, будь-якої діяльності.А також -надавати турботу з метою благополучного життя.Такий базовий блок дозволяє уважно і детально розібратися в хвилюючою проблеми.Володар вміє бути самостійним, обачним. Може розібратися в технологічних процесах, як і що де влаштовано, як потрібно організувати процес. Полагодити що-небудь, щоб працювало, як потрібно.Комфорт і акуратність забезпечуються для підтримки справ і процесів.";
            }
            if (Test1.resnewform == "LSE")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\EII.jpg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ЕІІ- «Достоєвський», БЕ + ЧІ\nІнтуїція можливостей для етики відносин\nБазовий блок БЕ + ЧІ працює на створення відносин і збереження відносин за допомогою різних можливостей.Дає глибоке розуміння суті відносин між людьми, етичних норм. Людина вміє шукати нові можливості для збереження своєї етичної картини світу.Вміє абстрагуватися від зовнішнього світу, якщо відносини з останнім не влаштовують. Може знайти спосіб ставитися до інших так, як вважає система цінностей конкретного власника.Якщо відносини навколо складаються не так, як хочеться, програма Тіма знайде спосіб піти від цих відносин, уникнути непотрібних зіткнень. Може бачити різні способи підходи до людям.Різні можливості встановлення контактів між людьми. Уміють виправдовувати вчинки інших людей для збереження колишнього ставлення до них.Або шукають спосіб відсторонитися абстрагуватися.";
            }
            if (Test1.resnewform == "IEE")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\SLI.jpg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "СЛІ «Габен», БС + ДЛ\nДілова логіка для сенсорики відчуттів\nСправи, робота, забезпечення ефективності для створення максимально комфортної обстановки для себе і близького оточення. Такий базовий блок дає вміння створювати комфорт своїми діями.Може вміло працювати з технікою.Вміє бути акуратним, раціональним.Добре відчуває обстановку навколо, простір. Вміє раціонально вирішувати фінансові та побутові питання.Технології, техніки вміють використовуватися для забезпечення комфорту.Базовий блок працює на збереження і поліпшення фізичних відчуттів, відчуття комфорту. При бажанні його володаря, вміє стежити за зовнішністю, виглядати красиво(за критеріями володаря), не особливо напружуючись, а доречними раціональними діями. Вміє знайти спосіб забезпечити собі максимум комфорту за рахунок раціонального витрачання сил і засобів.";
            }
            if (Test1.resnewform == "SLI")
            {
                MyImage = (Bitmap)Image.FromFile(@"Data\IEE.jpg", true);
                typePicture.Image = (Image)MyImage;
                resultInfo.Text = "ІЕЕ- «Гекслі», ЧI + БЕ\nЕтика відносин для інтуїції можливостей\nБазовий блок Гекслі працює на пошук і відкриття нових можливостей. Можуть налагоджувати різні контакти, будувати відносини з різними людьми. Ставлення до інших може змінюватися в залежності від ситуації.Людині цікаві нові можливості. За допомогою контакту з людьми, колективами - розширюють свій світогляд, шукають нові інтереси, ідеї.Базовий блок вимагає різноманітного, нового спілкування.Базовий блок дозволяє експериментувати в стосунках з людьми, гнучко використовуючи різну тактику в різних ситуаціях. Відчуває іншу людину, і може вибудовувати з ним найрізноманітніші відносини.";
            }
        }
    }
}
